ci4/app/Controllers/User.php

    public function index()
    {
        // Judul halaman
        $title = 'Daftar User';

        // Panggil model User
        $model = new UserModel();

        // Ambil semua data user dari database
        $users = $model->findAll();
---
SELECT *
FROM `user`

    public function login()
    {
        // Load helper form untuk validasi sederhana
        helper(['form']);

        // Ambil data dari form (jika ada)
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // ------------------------------------------------------
        // KASUS 1: Belum ada input email (tampilkan form login)
        // ------------------------------------------------------
        if (!$email) {
            return view('user/login');
        }

        // ------------------------------------------------------
        // KASUS 2: Ada input email (proses login)
        // ------------------------------------------------------

        // Inisialisasi session
        $session = session();

        // Panggil model User
        $model = new UserModel();

        // Cari user berdasarkan email
        $login = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'admin@gmail.com'
 LIMIT 1